const rawCompany = `게임파크
경향신문
고려이앤씨
광동제약
교보문고
교보생명보험
교원그룹
교학사
국도화학
국민은행 (KB)
국민일보
국순당
국정교과서 (단체)
귀뚜라미
그라비티
그랜드마트
그랜드백화점
금복주
금호리조트
금호산업
금호석유화학
금호아시아나그룹
금호타이어
기륭전자
기아자동차(현대자동차그룹)
나라케이아이씨
나이스신용평가
나이스평가정보
남양유업
남해화학
네오위즈홀딩스
네이버
넥센타이어
넥슨
넷마블게임즈
넷피아
노컷뉴스
노피어레코즈
녹십자
농심
농심켈로그
농협
뉴데일리
뉴스타운
다모아자동차
다솜투어
다이소아성산업
단성사
대구텍
대림그룹
대성출판
대신증권
대우건설
대우전자
대우전자부품
대우조선해양
대웅제약
대원강업
대원교통
대원씨아이
대한극장
대한제분
대한통운
대한항공(한진그룹)
더블랙레이블
데일리안
도미노피자
도원교통
동국제강
동부건설
동부제철
동서식품
동성제약
동아운수
동아제약
동양시멘트
동원F&B
동원건설
동일방직
동화약품
두루두루amc
두산건설
두산그룹
두산동아
두산인프라코어(과거에는 대우중공업)
두산중공업
듀오정보
디엔에이링크
디지틀조선
라사라패션디자인전문학교
락앤락
로엔 엔터테인먼트
로윈
롯데관광개발
롯데그룹
롯데글로벌로지스
롯데면세점
롯데백화점
롯데쇼핑
롯데정밀화학
롯데제과
롯데지알에스
롯데지주
롯데카드
롯데푸드
롯데하이마트
롯데호텔
르까프
르노삼성자동차
메가마트
메가박스
메가스터디
매그나칩
메디케어그룹
메리츠화재해상보험
명문제약
명화공업
모나미
모드 크리에이션 뮌헨
무림 그룹
무학 (기업)
문화방송 (MBC)
문화일보
문화창고
미래산업
미래에셋
미래에셋생명보험
미래엔
미샤 (화장품)
박스마스터
반도그룹
반디앤루니스
범양건영
벡셀
벽산그룹
보광그룹 (휘닉스, 코아로직)
부광약품
부산교통공사
부산은행
부영그룹
비상에듀
비씨카드
빅히트 엔터테인먼트
빙그레
삼성SDI(삼성그룹)
삼성SDS(삼성그룹)
삼성그룹
삼성디스플레이
삼성물산
삼성생명
삼성선물
삼성엔지니어링
삼성자산운용
삼성전자
삼성전자로지텍
삼성전자서비스
삼성전자판매
삼성증권
삼성카드
삼성화재
삼우종합건축사사무소
삼익THK
삼익악기
삼일제약
삼천리 자전거
삼표시멘트
삼화고속
삼화네트웍스
삼화상운
새하컴즈
샘표 (기업)
서부운수
서울교통공사(서울메트로, 서울도시철도공사가 합병하여 생김)
서울극장
서울식품공업
서울신문
서호전기
서희건설
선우 (기업)
선진운수
설빙 (기업)
성신양회
세번걸이 엔터테인먼트
세븐시즌스
세아그룹
셀트리온
소방방재신문
손오공 (기업)
스킨푸드
스타일난다
스톤뮤직 엔터테인먼트
스튜디오드래곤
스튜디오애니멀
스파오
스프리스
시너지이노베이션
신라면세점
신성교통
신세계
신한은행
심엔터테인먼트
씨그널엔터테인먼트그룹
씨제스엔터테인먼트
아모레퍼시픽
아사달 (기업)
아시아나항공
아시아펀드
아이덴티티 게임즈
아이리버
아이코닉스 엔터테인먼트
아주그룹
아진산업
아진카인텍
아프리카TV
안다미로 (게임 기업)
안랩
안산도시공사
에스알
에쓰오일
에이스침대
엔씨소프트
연합뉴스
영남일보
영안모자
영원무역
영진약품
영풍문고
예림당
오뚜기
오르비스 옵티무스
오리온
오콘
오토아이티
용평리조트
우리들제약
우리은행
우리카드
우리투자증권
우신산업
웅진그룹
웅진식품
워커힐
월간조선
윕스
유성기업
유수홀딩스
유안타증권
유진그룹
유진콘크리트
유한양행
유화증권
윤선생영어교실
이랜드그룹
이마트
이브자리
이수그룹
이수화학
이스타항공
이스트소프트
이투스교육
인천교통공사
인천국제공항공사
인터파크
일간스포츠
일동제약
잉카인터넷
자일대우버스
전북은행
정수장학회
제일기획
제일여객
제주은행
제주항공
조광피혁
조선일보
종근당그룹
좋은책신사고
기업은행
중앙일보
천재교육
카카오 (기업)
카프로
코스콤
코오롱건설
코오롱그룹
코오롱글로벌
코오롱인더스트리
코원시스템
쿠쿠전자
쿠팡
큐브 엔터테인먼트
크라운제과
큰길
키움증권
키위미디어그룹
태광그룹
태양금속공업
태영건설
통일그룹
티몬
티웨이항공
파라다이스
파리바게뜨
팬택계열 (해체)
펜타비전
포스코AST
포스코
포스코강판
포스코건설
포스코대우
포스코플랜텍
풀무원
풍산홀딩스
프라우나
프로스펙스
프로토자동차
피자헛
하나금융그룹
하나대투증권
하나카드
하나투어
하이트진로홀딩스
한겨레신문
한국GM
한국brt
한국가스공사
한국거래소
한국경제TV
한국공항공사
한국교육방송공사 (EBS)
한국농어촌공사
한국도로공사
한국방송공사 (KBS)
한국방송광고진흥공사(코바코)
한국산업은행
한국수력원자력
한국수자원공사
한국스탠다드차타드은행
한국야쿠르트
한국은행(이곳은 기업, 국책기관, 행정기관의 역할을 겸하고 있음)
한국일보
한국전력공사
한국철도공사
한국타이어
한국토지공사
한국투자증권
한국화장품
한국화장품제조
한글과컴퓨터
한라그룹
한미약품
한솔그룹
한솔제지
한솔케미칼
한신공영
한양증권
한일합섬
한진그룹
한진중공업
한진칼
한진해운
한창제지
한화갤러리아타임월드
한화그룹
한화생명(과거에는 대한생명으로 신동아그룹 소속이었음)
한화손해보험
한화에어로스페이스
한화케미칼
한화투자증권
해태제과식품
현대그룹
현대글로비스
현대로템
현대모비스
현대엘리베이터
현대오일뱅크
현대자동차그룹
현대제철
현대중공업그룹
현대증권
현대카드
현대해상
호반건설
호텔신라
홈플러스
효성
휘닉스파크
휠라
휴맥스
흥국생명
AKOM (애니메이션 스튜디오)
BGF리테일
CJ CGV
CJ E&M
CJ그룹
CJ엔터테인먼트
CJ올리브영
CJ인터넷
CJ제일제당
CJ푸드빌
CU (편의점)
DB그룹
GS그룹
GS글로벌
GS리테일
GS칼텍스
GS홈쇼핑
G마켓
HDC 영창
HDC현대산업개발
JYP 엔터테인먼트
KBS N
KBS 미디어
KCC
KD운송그룹
KEB하나은행
KPX케미칼
KT&G
KT (한국통신)
LG그룹
LG상사
LG생활건강
LG유플러스
LG전자
LG화학
LS그룹
LS산전
MP그룹
OB 맥주 (카스)
SBS (대한민국의 방송사)
SFA
SG 신성건설
SG세계물산
SK E&S
SK건설
SK그룹
SK네트웍스
SK스토아
SK브로드밴드
SK에너지
SK엠앤서비스
SK와이번스
SK이노베이션
SK증권
SK커뮤니케이션즈
SK케미칼
SK텔레콤
SK텔링크
SK하이닉스
SL (기업)
SM 엔터테인먼트
SPC 그룹
SPC삼립
STX
STX건설
STX중공업
SWC
YES24
YG 엔터테인먼트
YG케이플러스
YG플러스
YTN`;

const company = rawCompany.split("\n");
console.log(company.length);
console.log(company);
const fs = require("fs");
fs.writeFile("./companyList", company, () => {
    console.log("success");
});
